app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "test"], ["description", "desc"], ["created_at", "2017-09-07 10:44:29.819733"], ["updated_at", "2017-09-07 10:44:29.819733"]]

  def update
    respond_to do |format|
      if @task.update(task_params)
---
UPDATE "tasks" SET "description" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["description", "desc23"], ["updated_at", "2017-09-07 11:12:02.027099"], ["id", 2]]

  def destroy
    @task.destroy
---
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 1]]